// app/constants/gameData.js

export const allChampions = [
        '가렌', '갈리오', '갱플랭크', '그라가스', '그레이브즈', '그웬', '나르', '나미', '나서스', '노틸러스',
        '녹턴', '누누와 윌럼프', '니달리', '니코', '닐라', '다리우스', '다이애나', '드레이븐', '라이즈', '라칸',
        '람머스', '럭스', '럼블', '레나타 글라스크', '레넥톤', '레오나', '렉사이', '렐', '렝가', '루시안',
        '룰루', '르블랑', '리 신', '리븐', '리산드라', '릴리아', '마스터 이', '마오카이', '말자하', '말파이트',
        '모데카이저', '모르가나', '문도 박사', '미스 포츈', '밀리오', '바드', '바루스', '바이', '베이가', '베인',
        '벡스', '벨베스', '벨코즈', '볼리베어', '브라움', '브랜드', '브라이어', '블라디미르', '블리츠크랭크', '빅토르',
        '뽀삐', '사미라', '사이온', '사일러스', '샤코', '세나', '세라핀', '세주아니', '세트', '소나',
        '소라카', '쉔', '쉬바나', '스웨인', '스카너', '시비르', '신 짜오', '신드라', '신지드', '쓰레쉬',
        '아리', '아무무', '아우렐리온 솔', '아이번', '아지르', '아칼리', '아크샨', '아트록스', '아펠리오스', '알리스타',
        '애니', '애니비아', '애쉬', '야스오', '에코', '엘리스', '오공', '오른', '오리아나', '올라프',
        '요네', '요릭', '우디르', '우르곳', '워윅', '유미', '이렐리아', '이블린', '이즈리얼', '일라오이',
        '자르반 4세', '자야', '자이라', '자크', '잔나', '잭스', '제드', '제라스', '제리', '제이스',
        '조이', '직스', '진', '질리언', '징크스', '초가스', '카르마', '카밀', '카사딘', '카서스',
        '카시오페아', '카이사', '카직스', '카타리나', '칼리스타', '케넨', '케이틀린', '케인', '케일', '코그모',
        '코르키', '퀸', '크산테', '클레드', '키아나', '킨드레드', '타릭', '탈론', '탈리야', '탐 켄치',
        '트런들', '트리스타나', '트린다미어', '트위스티드 페이트', '트위치', '티모', '파이크', '판테온', '피들스틱', '피오라',
        '피즈', '하이머딩거', '헤카림', '흐웨이'].sort();

export const allAgents = [
        '게코', '네온', '데드락', '레이나', '레이즈', '멘', '바이퍼', '브리치', '브림스톤',
        '세이지', '소바', '스카이', '아스트라', '아이소', '오멘', '요루', '제트', '체임버',
        '케이오', '킬조이', '페이드', '페닉스', '하버'
    ].sort();

export const allLolMaps = [
  '소환사의 협곡',
  '칼바람 나락',
  '협곡 나락',
  '전략적 팀 전투'
];

export const allValorantMaps = [
  '어센트',
  '바인드',
  '헤이븐',
  '스플릿',
  '아이스박스',
  '브리즈',
  '프랙처',
  '펄',
  '로터스',
  '선셋',
  '베이븐'
];

export const tierMap = {
            '아이언': 'tier-iron',
            '브론즈': 'tier-bronze',
            '실버': 'tier-silver',
            '골드': 'tier-gold',
            '플래티넘': 'tier-platinum',
            '다이아몬드': 'tier-diamond',
            '마스터': 'tier-master',
            '그랜드마스터': 'tier-grandmaster',
            '챌린저': 'tier-challenger',
            '불멸': 'tier-불멸',
            '레이디언트': 'tier-레이디언트'
        };
